In [24]:
import pandas as pd

# 1. Data Exploration

In [25]:
df= pd.read_csv('Files/data.csv')
df.to_csv('out.csv', index=False)

In [26]:
df.head()

,order_id,customer_id,order_date,product,category,quantity,unit_price,city,returned,rating,total
0,1001,C001,2025-09-01,Widget A,Gadgets,2.0,199.99,Hyderabad,False,4.5,399.98
1,1002,C002,2025-09-01,Widget B,Gadgets,1.0,299.50,Hyderabad,False,5.0,299.50
2,1003,C003,2025-09-02,Gizmo X,Widgets,5.0,49.99,Mumbai,False,4.0,249.95
3,1004,C004,2025-09-03,Gizmo Y,Widgets,3.0,79.99,Delhi,True,NaN,239.97
4,1005,C005,2025-09-03,Widget A,Gadgets,1.0,199.99,Bengaluru,False,3.5,199.99

In [27]:
#last N rows
df.tail()

,order_id,customer_id,order_date,product,category,quantity,unit_price,city,returned,rating,total
27,1028,C027,2025-09-16,Gizmo Y,Widgets,1.0,79.99,Bengaluru,False,4.2,79.99
28,1029,C028,2025-09-17,Widget A,Gadgets,2.0,199.99,Hyderabad,False,4.9,399.98
29,1030,C029,2025-09-17,Gizmo X,Widgets,3.0,49.99,Kolkata,False,3.8,149.97
30,1031,C030,2025-09-18,Accessory Y,Accessories,4.0,19.99,Chennai,False,4.3,79.96
31,1032,C031,2025-09-18,Widget C,Gadgets,1.0,249.00,Delhi,False,4.5,249.00

In [28]:
#Metadata about the info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     32 non-null     int64
 1   customer_id  32 non-null     object
 2   order_date   31 non-null     object
 3   product      32 non-null     object
 4   category     32 non-null     object
 5   quantity     31 non-null     float64
 6   unit_price   32 non-null     float64
 7   city         32 non-null     object
 8   returned     32 non-null     bool
 9   rating       31 non-null     float64
 10  total        31 non-null     float64
dtypes: bool(1), float64(4), int64(1), object(5)
memory usage: 2.7+ KB

In [29]:
#summary Statistics
df.describe

<bound method NDFrame.describe of     order_id customer_id  order_date      product     category  quantity
0       1001        C001  2025-09-01     Widget A      Gadgets       2.0  \
1       1002        C002  2025-09-01     Widget B      Gadgets       1.0
2       1003        C003  2025-09-02      Gizmo X      Widgets       5.0
3       1004        C004  2025-09-03      Gizmo Y      Widgets       3.0
4       1005        C005  2025-09-03     Widget A      Gadgets       1.0
5       1006        C002  2025-09-04  Accessory Z  Accessories      10.0
6       1007        C006  2025-09-05     Widget C      Gadgets       NaN
7       1008        C007         NaN      Gizmo X      Widgets       2.0
8       1009        C008  2025-09-06  Accessory Z  Accessories       4.0
9       1010        C009  2025-09-06     Widget A      Gadgets       2.0
10      1011        C010  2025/09/07      Gizmo Y      Widgets       1.0
11      1012        C011  2025-09-08     Widget B      Gadgets       3.0
12      1013        C012  2025-09-09     Widget D      Gadgets       2.0
13      1014        C013  2025-09-09      Gizmo X      Widgets       1.0
14      1015        C014  2025-09-10  Accessory Y  Accessories       5.0
15      1016        C015  2025-09-10     Widget B      Gadgets       2.0
16      1017        C016  2025-09-11      Gizmo Z      Widgets       3.0
17      1018        C017  2025-09-11     Widget A      Gadgets       1.0
18      1019        C018  2025-09-12  Accessory Z  Accessories       8.0
19      1020        C019  2025-09-12      Gizmo Y      Widgets       2.0
20      1021        C020  2025-09-13     Widget C      Gadgets       3.0
21      1022        C021  2025-09-13      Gizmo X      Widgets       4.0
22      1023        C022  2025-09-14  Accessory Y  Accessories       6.0
23      1024        C023  2025-09-14     Widget D      Gadgets       1.0
24      1025        C024  2025-09-15      Gizmo Z      Widgets       2.0
25      1026        C025  2025-09-15     Widget B      Gadgets       3.0
26      1027        C026  2025-09-16  Accessory Z  Accessories       5.0
27      1028        C027  2025-09-16      Gizmo Y      Widgets       1.0
28      1029        C028  2025-09-17     Widget A      Gadgets       2.0
29      1030        C029  2025-09-17      Gizmo X      Widgets       3.0
30      1031        C030  2025-09-18  Accessory Y  Accessories       4.0
31      1032        C031  2025-09-18     Widget C      Gadgets       1.0

    unit_price       city  returned  rating   total
0       199.99  Hyderabad     False     4.5  399.98
1       299.50  Hyderabad     False     5.0  299.50
2        49.99     Mumbai     False     4.0  249.95
3        79.99      Delhi      True     NaN  239.97
4       199.99  Bengaluru     False     3.5  199.99
5         9.99  Hyderabad     False     4.8   99.90
6       249.00    Chennai     False     4.2     NaN
7        49.99     Mumbai     False     4.1   99.98
8         9.99      Delhi      True     2.0   39.96
9       199.99  Hyderabad     False     4.9  399.98
10       79.99  Bengaluru     False     4.3   79.99
11      299.50    Kolkata     False     3.9  898.50
12      149.99    Chennai     False     4.6  299.98
13       49.99     Mumbai     False     4.2   49.99
14       19.99      Delhi     False     3.8   99.95
15      299.50  Bengaluru      True     4.1  599.00
16       59.99  Hyderabad     False     4.0  179.97
17      199.99    Kolkata     False     4.5  199.99
18        9.99    Chennai     False     4.7   79.92
19       79.99     Mumbai      True     3.5  159.98
20      249.00      Delhi     False     4.8  747.00
21       49.99  Bengaluru     False     4.0  199.96
22       19.99  Hyderabad     False     3.9  119.94
23      149.99    Kolkata     False     4.4  149.99
24       59.99    Chennai     False     4.1  119.98
25      299.50      Delhi      True     3.7  898.50
26        9.99     Mumbai     False     4.6   49.95
27       79.99  Bengaluru     False     4.2   79.99
28      199.99  Hyderabad     False     4.9  399.98
29       49.99    Kolkata     False     3.8  149.97
30       19.99    Chennai     False     4.3   79.96
31      249.00      Delhi     False     4.5  249.00  >

In [31]:
#(rows,columns)
df.shape

(32, 11)

In [33]:
#Column Names
df.columns

Index(['order_id', 'customer_id', 'order_date', 'product', 'category',
       'quantity', 'unit_price', 'city', 'returned', 'rating', 'total'],
      dtype='object')

In [ ]:
#Column data types
df.dtypes

order_id         int64
customer_id     object
order_date      object
product         object
category        object
quantity       float64
unit_price     float64
city            object
returned          bool
rating         float64
total          float64
dtype: object

In [39]:
df.index
#Get total number of elements
df.size
#Get number of dimensions
df.ndim

2

In [ ]:
#Get total number of elements
df.size

352

In [38]:
#Get number of dimensions
df.ndim

2

# 2. Descriptive Statistics

In [41]:
#Summary statistics for numeric columns
df.describe()

          order_id   quantity  unit_price     rating       total
count    32.000000  31.000000   32.000000  31.000000   31.000000
mean   1016.500000   3.000000  126.085938   4.187097  255.506452
std       9.380832   2.144761  102.852379   0.576045  235.456184
min    1001.000000   1.000000    9.990000   2.000000   39.960000
25%    1008.750000   1.500000   49.990000   3.950000   99.925000
50%    1016.500000   2.000000   79.990000   4.200000  179.970000
75%    1024.250000   4.000000  199.990000   4.550000  299.740000
max    1032.000000  10.000000  299.500000   5.000000  898.500000

In [44]:
#Include categorical columns too
df.describe(include='all')

,order_id,customer_id,order_date,product,category,quantity,unit_price,city,returned,rating,total
count,32.000000,32,31,32,32,31.000000,32.000000,32,32,31.000000,31.000000
unique,NaN,31,18,9,3,NaN,NaN,6,2,NaN,NaN
top,NaN,C002,2025-09-01,Widget A,Gadgets,NaN,NaN,Hyderabad,False,NaN,NaN
freq,NaN,2,2,5,14,NaN,NaN,7,27,NaN,NaN
mean,1016.500000,NaN,NaN,NaN,NaN,3.000000,126.085938,NaN,NaN,4.187097,255.506452
std,9.380832,NaN,NaN,NaN,NaN,2.144761,102.852379,NaN,NaN,0.576045,235.456184
min,1001.000000,NaN,NaN,NaN,NaN,1.000000,9.990000,NaN,NaN,2.000000,39.960000
25%,1008.750000,NaN,NaN,NaN,NaN,1.500000,49.990000,NaN,NaN,3.950000,99.925000
50%,1016.500000,NaN,NaN,NaN,NaN,2.000000,79.990000,NaN,NaN,4.200000,179.970000
75%,1024.250000,NaN,NaN,NaN,NaN,4.000000,199.990000,NaN,NaN,4.550000,299.740000
max,1032.000000,NaN,NaN,NaN,NaN,10.000000,299.500000,NaN,NaN,5.000000,898.500000

In [50]:
#Mean of numeric columns
df.mean(numeric_only=True)

order_id      1016.500000
quantity         3.000000
unit_price     126.085938
returned         0.156250
rating           4.187097
total          255.506452
dtype: float64

In [51]:
#Median of numeric columns
df.median(numeric_only=True)

order_id      1016.50
quantity         2.00
unit_price      79.99
returned         0.00
rating           4.20
total          179.97
dtype: float64

In [52]:
#Minimum / Maximum values
df.min(numeric_only=True)

order_id       1001
quantity        1.0
unit_price     9.99
returned      False
rating          2.0
total         39.96
dtype: object

In [54]:
df.max(numeric_only=True)

order_id       1032
quantity       10.0
unit_price    299.5
returned       True
rating          5.0
total         898.5
dtype: object

In [53]:
#Standard Deviation
df.std(numeric_only=True)

order_id        9.380832
quantity        2.144761
unit_price    102.852379
returned        0.368902
rating          0.576045
total         235.456184
dtype: float64

In [55]:
df.var(numeric_only=True)

order_id         88.000000
quantity          4.600000
unit_price    10578.611812
returned          0.136089
rating            0.331828
total         55439.614570
dtype: float64

In [56]:
#Count of non-null values per column
df.count()

order_id       32
customer_id    32
order_date     31
product        32
category       32
quantity       31
unit_price     32
city           32
returned       32
rating         31
total          31
dtype: int64

In [57]:
#Number of unique values per column
df.nunique()

order_id       32
customer_id    31
order_date     18
product         9
category        3
quantity        8
unit_price      9
city            6
returned        2
rating         16
total          26
dtype: int64

In [59]:
#Correlation matrix for numeric columns
df.corr(numeric_only=True)

,order_id,quantity,unit_price,returned,rating,total
order_id,1.000000,-5.306809e-02,-0.110849,-0.069911,5.981513e-02,-0.030072
quantity,-0.053068,1.000000e+00,-0.523441,-0.041569,-3.115234e-16,-0.166169
unit_price,-0.110849,-5.234414e-01,1.000000,0.117785,2.583309e-01,0.810873
returned,-0.069911,-4.156900e-02,0.117785,1.000000,-5.855552e-01,0.249863
rating,0.059815,-3.115234e-16,0.258331,-0.585555,1.000000e+00,0.119996
total,-0.030072,-1.661686e-01,0.810873,0.249863,1.199964e-01,1.000000

In [60]:
#Covariance matrix for numeric columns
df.cov(numeric_only=True)

,order_id,quantity,unit_price,returned,rating,total
order_id,88.000000,-1.066667e+00,-106.951452,-0.241935,3.187097e-01,-66.358043
quantity,-1.066667,4.600000e+00,-114.551667,-0.033333,-3.981489e-16,-83.914667
unit_price,-106.951452,-1.145517e+02,10578.611812,4.469042,1.550637e+01,19481.270294
returned,-0.241935,-3.333333e-02,4.469042,0.136089,-1.149462e-01,21.995925
rating,0.318710,-3.981489e-16,15.506372,-0.114946,3.318280e-01,16.835336
total,-66.358043,-8.391467e+01,19481.270294,21.995925,1.683534e+01,55439.614570

In [62]:
#Skewness of numeric columns
df.skew(numeric_only=True)

order_id      0.000000
quantity      1.625243
unit_price    0.488981
returned      1.987881
rating       -1.735228
total         1.721591
dtype: float64